Revit 2026 API

# ReferencePointArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferencePointArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ReferencePointArrayIterator()
```
```fsharp
new : unit -> ReferencePointArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ReferencePointArrayIterator Class

Autodesk.Revit.DB Namespace